"""Снабди каждый комментарий правильной командой."""

python3 -V  # команда для проверки текущей версии Питона
python3  # запуск интерпретатора Питона в режиме REPL
python -m venv env  # создание виртуального окружения в текущей директории
activate.bat  # активация вышесозданного виртуального окружения
deactivate.bat  # деактивация виртуального окружения
python3 -m run.py  # запуск скрипта run.py находящегося в текущей директории
pip install requests  # установка пакета requests через пакетный менеджер pip
